screenshots/cassandra/cassandra-data-load.log
YCSB Client 0.8.0
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -P workloads/workloada -p recordcount=1000000 -p hosts=localhost -load
Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
Connected to cluster: Test Cluster
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 367002.0
[OVERALL], Throughput(ops/sec), 2724.780791385333
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2221056.0
[CLEANUP], MinLatency(us), 2220032.0
[CLEANUP], MaxLatency(us), 2222079.0
[CLEANUP], 95thPercentileLatency(us), 2222079.0
[CLEANUP], 99thPercentileLatency(us), 2222079.0
[INSERT], Operations, 1000000.0
[INSERT], AverageLatency(us), 361.303321
[INSERT], MinLatency(us), 192.0
[INSERT], MaxLatency(us), 424959.0
[INSERT], 95thPercentileLatency(us), 527.0
[INSERT], 99thPercentileLatency(us), 603.0
[INSERT], Return=OK, 1000000